import Mock from 'mockjs';

export default {
    'error': 0,
    'data|10': [
        {
            // 存证提交时间 2017-08-03 17:00:01
            'time': Mock.Random.date('yyyy-MM-dd') + ' ' + Mock.Random.time('HH:mm:ss'),
            'file_name|1': [ // 文件名
                'wp-201708031700014714', // 默认文件名
                '我的录音文件',
                '我的录像文件'
            ],
            'file_type|1': [  // 文件类型
                0, // 网页截屏
                1, // 录像
                2, // 录音
                3, // 拍照
                4  // 网页
            ],
            'cert_no|1': [ // 存证编号
                '20170803170002026000',
                '20120803170002026000',
                '20150803170002026200'
            ],
            'full_mount_status|1': [ // 全挂状态
                -1, // 申请失败
                -2, // 挂链失败
                -3, // 确认失败
                0, // 未申请
                1, // 已申请
                2, // 已挂链
                3  // 已确认
            ],
            'single_mount_status|1': [ // 单挂状态
                -1, // 申请失败
                -2, // 挂链失败
                -3, // 确认失败
                0, // 未申请
                1, // 已申请
                2, // 已挂链
                3  // 已确认
            ],
            'file_status|1': [ // 文件状态
                -1, // 排队失败
                -2, // 操作失败
                0, // 处理中
                1, // 排队中
                2  // 操作已完成
            ]
        }
    ]
};
